In [1]:
import pandas as pd
df = pd.read_csv('abc.csv')

In [2]:
df

     name  marks       city
0   ayush    100    baglung
1  sharma    200       ohio
2    ravi   1000  kathmandu

In [4]:
df2 = df.stack

##

In [5]:
df2

<bound method DataFrame.stack of      name  marks       city
0   ayush    100    baglung
1  sharma    200       ohio
2    ravi   1000  kathmandu>